Unidad07_AlmacenamientoExterno/Practicas/Tarea_ParticionadoEnLaCumbre_01.tex
% Created 2019-12-04 mié 19:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas}
\date{\today}
\title{UD07 - Particionando en la Cumbre del Clima}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Descripción}
\label{sec-1}

En la cumbre del clima que se celebra en Madrid se necesitan una serie de
usuarios y de discos duros para el almacenamiento de los datos de las
conferencias.

La empresa adjudicataria hemos sido nosotros y debemos asegurarnos de que los
datos se almacenan en cada uno de los usuarios correctamente, ya que existen una
serie de \emph{backups} que deben hacerse al acabar el dia.

\section{Usuarios}
\label{sec-2}

En la máquina de Xubuntu que debemos que se llamará \textbf{Clima} instalar añadimos los siguientes usuarios.

\begin{center}
\begin{tabular}{lllll}
Nombre & Login & Password & Home & Adminstrador\\
Cientificos & cientificos & 100tificos & /home/cientificos & SI\\
Periodistas & periodistas & p3r10d1st4s & /cumbre/publico/periodistas & -\\
Politicos & politicos & p0l1t1c0s & /cumbre/asistentes/politicos & -\\
\end{tabular}
\end{center}

No crear las carpetas personales de los usuarios hasta que no se hayan añadido
los discos duros y esté particionados y con los sistemas de ficheros que se
muestran a continuación.

\section{Discos}
\label{sec-3}

Crear en el VirtualBox 2 discos de \emph{2 Gigas} cada uno con los siguientes nombres
y particiones.

\begin{center}
\begin{tabular}{ll}
Nombre de Disco en el Anfitrión & Dispositivo\\
clima.vdi & /dev/sdb\\
publico.vdi & /dev/sdc\\
\end{tabular}
\end{center}

Particiones

\begin{center}
\begin{tabular}{llll}
Dispositivo & Partición & Tipo & Punto de Montaje\\
/dev/sdb & /dev/sdb1 & ext4 & /cumbre/publico\\
/dev/sdc & /dev/sdc1 & ext4 & /cumbre/asistentes\\
\end{tabular}
\end{center}

Una vez realizado esto, modificar el perfil de los usuarios \emph{Periodistas} y
\emph{Políticos} para que su carpeta personal sea la que se ha mostrado en la tabla
anterior.

\section{Entrega}
\label{sec-4}

El fichero \emph{:}

\begin{minted}[]{bash}
/etc/fstab
\end{minted}

De la máquina Xubuntu cuando tengais todos los puntos de montaje listos.

Además, se pide la salida del comando 

\begin{minted}[]{bash}
cat /etc/passwd
\end{minted}

Y por supuesto tres capturas de inicio de sesión \emph{gráfica} de los tres usuarios,
mostrando que su carpeta personal se haya donde se ha establecido.
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}
